# Pandas - Basic Operations

In [1]:
import pandas as pd

### Create df from dictionary

In [2]:
dict = {'A' : [1 ,2, 3, 4, 5], 'B': ['a', 'b', 'c', 'd', 'e'], 'NUM': [0, 0, 0, 0, 0 ]}
df1 = pd.DataFrame(dict)
df1

   A  B  NUM
0  1  a    0
1  2  b    0
2  3  c    0
3  4  d    0
4  5  e    0

### Deep Copy

In [8]:
df2 = df1.copy() # deep copy is the default option
df2

   A  B  NUM
0  1  a    0
1  2  b    0
2  3  c    0
3  4  d    0
4  5  e    0

In [9]:
df2.drop(0, inplace=True) # we drop the first record and verity if the original df was not modified

In [10]:
df1

   A  B  NUM
0  1  a    0
1  2  b    0
2  3  c    0
3  4  d    0
4  5  e    0

### Shallow copy

In [4]:
df3 = df1.copy(deep = False) # 
df3

   A  B  NUM
0  1  a    0
1  2  b    0
2  3  c    0
3  4  d    0
4  5  e    0

In [13]:
df1.drop(0, inplace=True)

In [14]:
df1

   A  B  NUM
1  2  b    0
2  3  c    0
3  4  d    0
4  5  e    0

In [16]:
df3 # df3 also misses the first record (removed from df1)

   A  B  NUM
1  2  b    0
2  3  c    0
3  4  d    0
4  5  e    0